[
    {
        "date": "2016-01-22",
        "entry": "JANUARY 2016 RULES - BANNED/RESTRICTED UPDATE\nDuel Commander gets played more and more in the world, and regional coordinators have joined the\ncommittee to help us take the worldwide community into account. We want to thank the coordinators\nfor their help and we also want to thank all of you who participate in the expansion of Duel\nCommander.\n##\nIndividual:Cataclysm is unbanned.\nRules:The Duel Commander rules indicate that adding mana of any color to your mana pool that is not\npart of your Commander’s color identity gives colorless mana instead. Colorless mana obtained this\nway can be used to cast spells and use abilities that require \"true colorless\" mana (the new “◇”\nsymbol replacing the ① for costs). Cards which generate mana of any color (for example: City of\nBrass, Coalition Relic, Birds of paradise, ...) allow their controllers to use cards that require\n\"true colorless\" mana if your commander doesn't have a 5-color identity, for example.\nOther:No changes.\n##\nCataclysm:Cataclysm is a card with a very high power level and that requires a specific setup to\nreally shine. That was relatively easy to set up when Mystical Tutor was legal, since it allowed\nplayers to either find a necessary piece of disruption or a perfectly-timed Cataclysm. Now that\nMystical Tutor is banned, the card should be less regularly backbreaking than it used to be.\nBesides, the decks that will benefit the most from that unban aren't the best positionned in the\nformat (Abzan Disrupt / Geist of Saint Traft / Grand Arbiter Augustin IV).",
        "name": "JANUARY 2016 RULES - BANNED/RESTRICTED UPDATE",
        "head_comment": "Duel Commander gets played more and more in the world, and regional coordinators have joined the\ncommittee to help us take the worldwide community into account. We want to thank the coordinators\nfor their help and we also want to thank all of you who participate in the expansion of Duel\nCommander.",
        "Cataclysm": {
            "id": "b0479ca4-e925-4aa7-a4fa-f7e01f899ac5",
            "nom": "Cataclysm",
            "release": "1998-06-15",
            "scryfall": "024ae668-a1ae-4020-89c8-acbd8bd0a691",
            "explanation": "Cataclysm is a card with a very high power level and that requires a specific setup to really shine.\nThat was relatively easy to set up when Mystical Tutor was legal, since it allowed players to either\nfind a necessary piece of disruption or a perfectly-timed Cataclysm. Now that Mystical Tutor is\nbanned, the card should be less regularly backbreaking than it used to be. Besides, the decks that\nwill benefit the most from that unban aren't the best positionned in the format (Abzan Disrupt /\nGeist of Saint Traft / Grand Arbiter Augustin IV).",
            "status": "unbanned"
        },
        "Individual": [
            "Cataclysm is unbanned."
        ],
        "Other": [
            "No changes."
        ]
    },
    {
        "date": "2015-10-02",
        "entry": "SEPTEMBER 2015 RULES - BANNED/RESTRICTED UPDATE\nDuring the last three months, the format kept growing. We have been in contact with more and more\ncommunities, and we hope this will go on in the future.\n##\nIndividual:Sensei's divining top is now banned.\nRules: The Vancouver mulligan is now the legal mulligan in Dual Commander. Over the last years, the\npartial mulligan has changed from being a tool that was used to have less games lost on the starting\nhand to a powerful engine used in some strategies to take an early lead. During the last 3 months,\nwe decided to test the Vancouver mulligan. It appears it still allows players to play real Magic:\nThe Gathering games while not threatening the balance between decks and strategies. It seemed to be\nthe optimal solution for the Dual Commander format.\nOther:No changes.\n##\nSensei's divining top:The card was creating a lot of fuss because of its power and its impact on the\ngames' durations. During those 6 month being unbanned, Top didn't seem to have any positive impact\non the format, powering up decks that were already dominant decks. That's why Sensei's divining top\nis now banned.",
        "name": "SEPTEMBER 2015 RULES - BANNED/RESTRICTED UPDATE",
        "head_comment": "During the last three months, the format kept growing. We have been in contact with more and more\ncommunities, and we hope this will go on in the future.",
        "Sensei's divining top": {
            "id": "13575cf9-65c1-4861-b21e-eb2155e07766",
            "nom": "Sensei's divining top",
            "release": "2004-10-01",
            "scryfall": "4a08ca06-58db-4ce6-b490-be4bea8956a1",
            "explanation": "The card was creating a lot of fuss because of its power and its impact on the games' durations.\nDuring those 6 month being unbanned, Top didn't seem to have any positive impact on the format,\npowering up decks that were already dominant decks. That's why Sensei's divining top is now banned.",
            "status": "banned"
        },
        "Individual": [
            "Sensei's divining top is now banned."
        ],
        "Other": [
            "No changes."
        ]
    },
    {
        "date": "2015-07-17",
        "entry": "JULY 2015 RULES - BANNED/RESTRICTED UPDATE\nOver the last three months, Duel Commander events have been more numerous and more populated. The\nplayer activity on all media was also very intensive. Such dynamics are very positive for the format\nand we hope that it will keep on going.\n##\nIndividual:Mystical Tutor is now banned.\nRules:A commander will now be able to be put back to the Command Zone instead of going to its\nowner’s hand. This recent rules change has been added to multiplayer Commander recently. We chose to\nalso have it apply to Duel Commander.\nOther:No changes.\n##\nMystical Tutor:Mystical Tutor is a card that really favoured combo and control decks to the\ndetriment of aggressive decks, which is the opposite of the re-balancing decisions that our comitee\nturns to. Some of its interactions were formidable (miracle keyword cards) and it was really making\nplayers take too much advantage over the 99 unique cards rule, allowing players to include powerful\nbut situational cards (like Armageddon / Upheaval) with lesser risks. Seeing it banned also opens\nother unbans in the long run.",
        "name": "JULY 2015 RULES - BANNED/RESTRICTED UPDATE",
        "head_comment": "Over the last three months, Duel Commander events have been more numerous and more populated. The\nplayer activity on all media was also very intensive. Such dynamics are very positive for the format\nand we hope that it will keep on going.",
        "Mystical Tutor": {
            "id": "fb81f95c-70f8-4eb7-8d15-15d0ae23ec03",
            "nom": "Mystical Tutor",
            "release": "1996-10-08",
            "scryfall": "5d98101f-e32a-4a4a-a649-faa920d111ee",
            "explanation": "Mystical Tutor is a card that really favoured combo and control decks to the detriment of aggressive\ndecks, which is the opposite of the re-balancing decisions that our comitee turns to. Some of its\ninteractions were formidable (miracle keyword cards) and it was really making players take too much\nadvantage over the 99 unique cards rule, allowing players to include powerful but situational cards\n(like Armageddon / Upheaval) with lesser risks. Seeing it banned also opens other unbans in the long\nrun.",
            "status": "banned"
        },
        "Individual": [
            "Mystical Tutor is now banned."
        ],
        "Rules": [
            "A commander will now be able to be put back to the Command Zone instead of going to its owner’s hand. This recent rules change has been added to multiplayer Commander recently. We chose to also have it apply to Duel Commander."
        ],
        "Other": [
            "No changes."
        ]
    },
    {
        "date": "2015-03-23",
        "entry": "MARCH 2015 RULES - BANNED/RESTRICTED UPDATE\nThe format keeps growing, thanks to players’ involvement and thanks to new sets being released,\nespecially the ones that are dedicated to Commander. Choices among new legendary creatures with a\nstrong identity allow players to play a wide range of efficient strategies. We would like to promote\nsuch a diversity as much as possible. Having considered the current context, we do think players\nneed a maximum number of possibilities to properly explore the current metagame. Nevertheless, we\nstill have to restrict the overly fast pace of some unbalanced strategies.\n##\nIndividual:Entomb is now banned.\nIndividual:Food Chain is now banned.\nIndividual:Fastbond is now banned.\nIndividual:Winter Orb is now unbanned.\nIndividual:Crucible Of Worlds is now unbanned.\nIndividual:Sensei's Divining Top is now unbanned.\nIndividual:Braids, Cabal Minion is now unbanned.\nRules:No changes.\nOther:No changes.\n##\nEntomb:This cards allows explosive combos too early in the game. It’s the only card that both allows\nsearching through a library and moving a card in a beneficial zone for one single mana. The\npossibility given by Entomb overwehlms widely the structure we would like to give to Duel Commander.\nFood Chain:Food Chain is widely used in Duel Commander as the exile restriction is easily bypassed…\nThanks to the Commander rule and the specificities of some legendary creatures. Some of them allow\nimmediate recursion and a “collateral” profit. We do consider that the speed of such actions is\nreally too fast and also that interaction with those actions becomes too hard.\nFastbond:Fastbond is a dreadful mana accelerating card when played on the first turns but such a use\nremains seldom. Later in the game, its effect often becomes more limited by the inability to gather\nseveral lands in hand. Yet, sometimes, a synergy can break this (a “bounce-land”, cards like\nUpheaval, Sunder,…). Because of the releasing of new BUG possible commanders, such synergies found\nnew homes, in which they become “unhealthy” for the format. Moreover, we think that Crucible Of\nWorlds and Fastbond shouldn’t be on the same side of the banned/authorized lists. Those two cards\ntogether are too explosive for the format.\nWinter Orb:Having to face a growing number of decklists that revolve around final combos (hybrid\ndecks such as aggro/combo or control/combo), it appeared to us that we should offer an alternate\n“stax/prison” path for all archetypes. Such a path exists under many forms when based on the\nspecifications of the commander -whether we talk about its color(s) or power(s)-, but having access\nto an artifact offers more possibilities.\nCrucible Of Worlds:Previous statements regarding Winter Orb also apply here. The possibilities that\nare offered by Crucible Of Worlds as a constraints means or as a developing basis favours\ninteractive strategies. Having Crucible Of Worlds back also follows the editor’s choices, who\nconsiders graveyards as a whole resourceful zone, as opposed to the exile zone, that is a real zone\nof no return.\nSensei's Divining Top:Today, duel commander is supported by a lot of new associations and actively\nplayed by a lot of people. Therefore, it doesn’t seem appropriate for us to continue to monitor\nplaying time management and to take it as an element into consideration. Having excluded these\nconsiderations, we believe that this card isn’t unfair.\nBraids, Cabal Minion:This commander has been banned for a long time. Since then, all means available\nto put it into play quickly while paying its upkeep conditions have been limited. Moreover, the\nformat gave birth to a lot of powerful decks. We think that Braids, Cabal Minion can fit in duel\ncommander without having a negative impact on the format.",
        "name": "MARCH 2015 RULES - BANNED/RESTRICTED UPDATE",
        "head_comment": "The format keeps growing, thanks to players’ involvement and thanks to new sets being released,\nespecially the ones that are dedicated to Commander. Choices among new legendary creatures with a\nstrong identity allow players to play a wide range of efficient strategies. We would like to promote\nsuch a diversity as much as possible. Having considered the current context, we do think players\nneed a maximum number of possibilities to properly explore the current metagame. Nevertheless, we\nstill have to restrict the overly fast pace of some unbalanced strategies.",
        "Entomb": {
            "id": "299fc083-0834-4064-8344-f895aff68867",
            "nom": "Entomb",
            "release": "2001-10-01",
            "scryfall": "f60a2091-fb97-4f04-911b-fce9b6351044",
            "explanation": "This cards allows explosive combos too early in the game. It’s the only card that both allows\nsearching through a library and moving a card in a beneficial zone for one single mana. The\npossibility given by Entomb overwehlms widely the structure we would like to give to Duel Commander.",
            "status": "banned"
        },
        "Food Chain": {
            "id": "5c8e5092-962e-49ef-ab82-8434e475e4e7",
            "nom": "Food Chain",
            "release": "1999-10-04",
            "scryfall": "18a1bb9e-006c-495e-8f99-d451183d2669",
            "explanation": "Food Chain is widely used in Duel Commander as the exile restriction is easily bypassed… Thanks to\nthe Commander rule and the specificities of some legendary creatures. Some of them allow immediate\nrecursion and a “collateral” profit. We do consider that the speed of such actions is really too\nfast and also that interaction with those actions becomes too hard.",
            "status": "banned"
        },
        "Fastbond": {
            "id": "e27193b7-1a47-4555-865d-b1fd4c6d597f",
            "nom": "Fastbond",
            "release": "1993-08-05",
            "scryfall": "a575a9af-e1de-4a1d-91d8-440585377e4f",
            "explanation": "Fastbond is a dreadful mana accelerating card when played on the first turns but such a use remains\nseldom. Later in the game, its effect often becomes more limited by the inability to gather several\nlands in hand. Yet, sometimes, a synergy can break this (a “bounce-land”, cards like Upheaval,\nSunder,…). Because of the releasing of new BUG possible commanders, such synergies found new homes,\nin which they become “unhealthy” for the format. Moreover, we think that Crucible Of Worlds and\nFastbond shouldn’t be on the same side of the banned/authorized lists. Those two cards together are\ntoo explosive for the format.",
            "status": "banned"
        },
        "Winter Orb": {
            "id": "1dcbd583-3388-4b34-a7cd-131648aa6abd",
            "nom": "Winter Orb",
            "release": "1993-08-05",
            "scryfall": "9359f60c-9a27-4e53-b35b-964a121a6fba",
            "explanation": "Having to face a growing number of decklists that revolve around final combos (hybrid decks such as\naggro/combo or control/combo), it appeared to us that we should offer an alternate “stax/prison”\npath for all archetypes. Such a path exists under many forms when based on the specifications of the\ncommander -whether we talk about its color(s) or power(s)-, but having access to an artifact offers\nmore possibilities.",
            "status": "unbanned"
        },
        "Crucible Of Worlds": {
            "id": "33c722cf-b4bf-431f-aefd-ee96241a7fbf",
            "nom": "Crucible Of Worlds",
            "release": "2004-06-04",
            "scryfall": "312a6058-de08-487d-95bd-b3c56807fdd6",
            "explanation": "Previous statements regarding Winter Orb also apply here. The possibilities that are offered by\nCrucible Of Worlds as a constraints means or as a developing basis favours interactive strategies.\nHaving Crucible Of Worlds back also follows the editor’s choices, who considers graveyards as a\nwhole resourceful zone, as opposed to the exile zone, that is a real zone of no return.",
            "status": "unbanned"
        },
        "Sensei's Divining Top": {
            "id": "13575cf9-65c1-4861-b21e-eb2155e07766",
            "nom": "Sensei's Divining Top",
            "release": "2004-10-01",
            "scryfall": "4a08ca06-58db-4ce6-b490-be4bea8956a1",
            "explanation": "Today, duel commander is supported by a lot of new associations and actively played by a lot of\npeople. Therefore, it doesn’t seem appropriate for us to continue to monitor playing time management\nand to take it as an element into consideration. Having excluded these considerations, we believe\nthat this card isn’t unfair.",
            "status": "unbanned"
        },
        "Braids, Cabal Minion": {
            "id": "d85aa59b-c6aa-4b2f-885c-59d6e5e6e8b9",
            "nom": "Braids, Cabal Minion",
            "release": "2001-10-01",
            "scryfall": "4dcdcad5-e4fb-480e-984f-1ac5cdc986b9",
            "explanation": "This commander has been banned for a long time. Since then, all means available to put it into play\nquickly while paying its upkeep conditions have been limited. Moreover, the format gave birth to a\nlot of powerful decks. We think that Braids, Cabal Minion can fit in duel commander without having a\nnegative impact on the format.",
            "status": "unbanned"
        },
        "Individual": [
            "Entomb is now banned.",
            "Food Chain is now banned.",
            "Fastbond is now banned.",
            "Winter Orb is now unbanned.",
            "Crucible Of Worlds is now unbanned.",
            "Sensei's Divining Top is now unbanned.",
            "Braids, Cabal Minion is now unbanned."
        ],
        "Rules": [
            "No changes."
        ],
        "Other": [
            "No changes."
        ]
    },
    {
        "date": "2015-01-01",
        "entry": "JANUARY 2015 RULES - BANNED/RESTRICTED UPDATE\nThe metagame is still shifting and hasn’t stabilized. At the moment the format looks healthy so no\nchanges appear necessary.\n##\nIndividual:No changes.\nRules:No changes.\nOther:No changes.\n##",
        "name": "JANUARY 2015 RULES - BANNED/RESTRICTED UPDATE",
        "head_comment": "The metagame is still shifting and hasn’t stabilized. At the moment the format looks healthy so no\nchanges appear necessary.",
        "Individual": [
            "No changes."
        ],
        "Rules": [
            "No changes."
        ],
        "Other": [
            "No changes."
        ]
    }
]