[
    {
        "date": "2016-09-22",
        "summary": "The Committee, with feedback from our Regional Coordinators and Consultants, and most important players (from local players, Duel Commander fanatics and even a former World Champion) have come to the conclusion that the current banlist philosophy isn’t efficient.<br>The attempt to lower the power level and dominance of Blue-based control and Green-based Elf decks in the current 30 life environment hasn’t been successful. Decks structured by Red, Black or White continue to fail to perform consistently. It is clear that solving this problem would require many bans and will greatly denature the format. The Committee has come to the conclusion that a major rules change is necessary to alleviate the inherent imbalance in the format.<br><strong>Starting with the Commander 2016 update (on November 11th, 2016), Duel Commander will be played with 20 life points instead of 30.</strong><br>The Committee wants to make sure that all players have time to adapt to the upcoming change. It would be unfair and disruptive to make such a large change without prior announcement. Tournaments run between now and the Novemberupdate can choose to run at either 30 or 20 life points in the interim. However, 30 starting life points will no longer be supported after the Commander 2016 update.<br>Second, about the rules change itself. A higher than 20 life total is a relic from the original multiplayer EDH format. However, Magic: The Gathering cards are designed for 20 total life points games being played in duel, the most played variant of the game. A healthy format is about a balance between aggressive and control strategies, along with a few combos. So far, in Duel Commander there are few powerful aggressive decks - the most played decks are a split between control and combo. Starting with 20 life will change that. Aggressive decks will now be able to enter the format. These life totals will also help keeping decent rounds lengths and, therefore, more enjoyable tournaments.<br>Third, the switch to 20 life will come with card unbans. Many cards that are overpowered in the 30 life format have the possibility to be unbanned in the 20 life format going forward. Not everything will be unbanned at once as some testing and data are still required. However, there will be at least five card unbans in the Commander 2016 update alongside the 20 life points update.",
        "newly_banned_as_commander": [],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": [],
        "newly_unbanned_in_deck": [],
        "explanations": {}
    }
]
