[
    {
        "date": "2017-07-17",
        "special": "",
        "newly_banned_as_commander": ["Geist of Saint Traft", "Jace, Vryn's Prodigy", "Bruse Tarl, Boorish Herder"],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Polymorph", "Emrakul, the Aeons Torn"],
        "newly_unbanned_in_deck": ["Ancient Tomb", "Mind Twist", "Fastbond"],
        "explanations": {
            "Geist of Saint Traft": "It's always hard to remove a historical commander. The true, recurring, solid outs that Geist of Saint Traft provides were already a strong problem when facing a higher starting life total, which they proved to be even more efficient at blowing up now, several months after they even got lowered back to normal. Geist of Saint Traft is one of the rare handfuls of commanders which have the evil hexproof ability, and the cheapest of them. The absolute lack of interactions it offers, the immediate pressure it gives -despite the absence of moxen- and the killing clock it gives, as much as its position in the format, forbidding many building strategies to exist or annihilating them makes Geist of Saint Traft too toxic to remain in the command zone.",
            "Jace, Vryn's Prodigy": "Among all the available commanders for control decks, Jace, Vryn's Prodigy is without a doubt the most proactive one. It enters the battlefield very early, it sculpts its owner's hand efficiently, up to the point that player can compose his or her deck with very \"metagame\" cards, like Hydroblast, or Mind Harness. During the game, it favours blue's favourite weapons, like instants and sorceries, abilities like flashback or delve, and generates card advantage easily. At some point, it allows setting up degenerate synergies that will quickly end games, with cards like Intuition, functional copycats of Time Walk, or High Tide. Jace, Vryn's Prodigy definitely has too many elements in its favor to remain eligible to the Command zone. In order to open the diversity of the format, Jace, Vryn's Prodigy is now banned as a commander.",
            "Bruse Tarl, Boorish Herder": "Bruse Tarl, Boorish Herder is a strong card. But most problematically: it's a toxic card. It shaped the metagame by removing all fair aggressive decks and most midrange decks. It is focusing the format by losing against mono-blue decks and beating mono-blue decks predators. Banning Bruse Tarl, Boorish Herder also allows keeping the very interesting Partner keyword which favours original and exotic deckbuilding. So it's unfortunately time for Bruse Tarl, Boorish Herder to leave us.",
            "Polymorph": "Having a gigantic creature entering the battlefield at a reduced cost is a dreadful strategy that should be subject to reasonable constraints. The interaction between Polymorph and the Command zone makes it unfair. Indeed, in Duel Commander, Polymorph is definitely freed from its initial constraint: producing a creature without playing creature cards. We're reaching the breaking point of those reasonable constraints when Polymorph is paired with highly synergic commanders like Baral, Chief of Compliance (that allows it to happen on turn 3) or Vendilion Clique (which controls possible answers). Because of the danger it represents in Duel Commander, Polymorph is now banned.",
            "Emrakul, the Aeons Torn": "Emrakul, the Aeons Torn is most of the time the end of any strategic approach of a game. Being nearly impossible to kill and having Annihilator 6 makes it overwhelming. If Emrakul, the Aeons Torn was only cast during the later parts of games, it wouldn't be a problem. But with cards like Synthetic Destiny or even Through the Breach it can enter the battlefield way too early. The card is also very (very) rarely cast for {15}. Adding no value to format and causing some trouble, we choose to ban Emrakul, the Aeons Torn from Duel Commander.",
            "Ancient Tomb": "The ban of Ancient Tomb is mostly an archaism of the 30 starting life totals era. Without any playable aggressive strategy, it was a flawless 2-mana land. This is not true today anymore! Ancient Tomb is still a great card, but a very risky one. Bringing back Ancient Tomb also promotes strategic complexity of the format by offering more versatility in mana development. So… Welcome back Ancient Tomb! But beware: the world has changed ...",
            "Mind Twist": "Mind Twist is one of the first cards to be banned in Magic, back in 1994. Even if there are many combinations one could dream of with Mind Twist (with fast mana elves or Dark Ritual, for example) most of the time it ends up being an expensive Hymn to Tourach. Also, fast mana is now getting harder to produce in Duel Commander. The pro-active metagame also means more active decks and Mind Twisting an opponent's hand by turn 4 is not such a good deal now. The command zone also reduces the impact of mass discard. This is why we think it's the right time to bring back this iconic card in Duel Commander.",
            "Fastbond": "Fastbond is explosive in most early games (with many more conditions than it looks, though) and often forsaken in the late game state, despite the presence of Crucible of Worlds or The Gitrog Monster, or Ramunap Excavator. Despite the fact that it has led to aberrant starts in the past, the drawback is now far more problematic. Fastbond still holds a high potential, yet it is tamed by the pace of the format we've had for a few months now. We also think Duel Commander is more spectacular with that kind of broken cards than when played with four copies. Therefore, Fastbond is worth a come back."
        }
    }
]
