[
    {
        "date": "2017-09-25",
        "special": "",
        "newly_banned_as_commander": ["Edgar Markov"],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Fireblast", "Eidolon of the Great Revel", "Sulfuric Vortex", "Price of Progress"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Edgar Markov": "Before \"Eminence\" got released in Commander 2017, two commanders got abilities that somehow worked from the command zone: Oloro, Ageless Ascetic and, to a lesser extend, Derevi, Empyrial Tactician. Both of them are banned in Duel Commander. Having abilities on cards that actually work from the command zone negates the concept of casting commanders, and are very easily overpowered when played in duel. Edgar Markov clearly offers the ability to build a very solid, overly intense tribal deck revolving around vampires. The flavor is cool, but the taste is not. For 4 weeks already the card dominated most tournaments it got in, polarizing the next ones to \"Edgar VS anti-Edgar\" strategies only. Which is the very definition of \"going against diversity\". Which also demonstrates the expected and found power of the card. Which easily explains why Edgar Markov is now banned as a commander.",
            "Fireblast": "Once most burn decks reach a certain amount of lands, they don't require any further use of them. As there's usually no way to excel at drawing cards and refilling their owners' hands. So, additional lands aren't needed and therefore Fireblast becomes totally free, without any drawback. The tempo of the card is also obviously very good. If Fireblast has a very rich past in this archetype in other formats it is even stronger in singleton. As a singleton card your opponent cannot \"play around\" it as you play only one with no tutor. In a singleton game one will never draw two of them and two Fireblast is not that great as you play nonbasic lands and as you don't always reach 4 mountains. Too many reasons why, actually, Fireblast needs to be banned in Duel Commander.",
            "Eidolon of the Great Revel": "Close to Pyrostatic Pillar as a creature, which makes it easier to handle in exchange for having it do more damage by attacking. Eidolon of the Great Revel is included in 100% red/burn decklists and usually does between 6 and 10 damage by itself on a regular basis. Eidolon of the Great Revel is also an \"always win\" card. If it survives it deals massive damage. If it dies it will have dealt at least two damage to the opponent (and made him/her spend a card and mana). Now, Duel Commander the average converted mana cost of spells is lower as the format is getting more and more competitive. Needless to say how much of a pressure this card is for opponents, this card, a key one in burn decks, is not authorized anymore in Duel Commander.",
            "Sulfuric Vortex": "Sulfuric Vortex creates a specific problem in Duel Commander as it totally wrecks some strategies. Lots of decks cannot handle it and cannot win because of it. This is a major problem for the concept of the format. Sulfuric Vortex is also a great card against other decks, as it's an enchantment (therefore harder to remove), it generates a great clock (quicker than most control decks) and prevents gaining life (burn archetypes' nemesis). Sulfuric Vortex is also widely played in burn decks in all formats. Another worrying issue is that Sulfuric Vortex punishes people who build against burn decks as it makes their metagame cards almost useless. Negating deckbuilding and adaptation is not what we want to see. For all these reasons, Sulfuric Vortex is not allowed in Duel Commander anymore.",
            "Price of Progress": "Price of Progress is also enhanced by the singleton aspect of Duel Commander. As you cannot play as many fetchlands (that can protect you from Price of Progress) you have to play more dual/nonbasic lands than you usually would in regular formats. This is especially true for two-colored decks. The singleton aspect also strengthens Price of Progress as a \"not worth building or playing to prepare against it\" card, as it is played in decks with no tutoring effects. Among the key \"burn\" cards that exist and that get played a lot in Duel Commander, this one is really unique in terms of damage range. For allowing many cheap, immediate ends in too many games, Price of Progress is now banned in Duel Commander."
        }
    }
]
