[
    {
        "date": "2017-04-17",
        "special": "",
        "newly_banned_as_commander": ["Breya, Etherium Shaper", "Vial Smasher the Fierce"],
        "newly_unbanned_as_commander": ["Yisan, The Wanderer Bard"],
        "newly_banned_in_deck": ["Chrome Mox", "Mox Diamond"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Breya, Etherium Shaper": "Among the control decks currently running in Duel Commander, the dominant archetypes rely on removal spells ({U}{x}) and archetypes that revolve around combos, backed up by counterspells (mostly mono-blue ones). The arrival of Breya, Etherium Shaper quickly shut down the first category as being an absolute better offer. Her colour identity offers little weakness, her abilities crush opposing board presence and she even has opportunities to integrate \"instant-win\" combinations. Breya, Etherium Shaper outclasses all other available commanders in terms of versatility and power. Such a superiority is highly problematic: in order to prevent uniform control strategies that end up being particularly oppressive for aggressive decks, Breya, Etherium Shaper is now banned as a commander.",
            "Yisan, The Wanderer Bard": "When we banned Yisan, The Wanderer Bard, almost no quick spot removal spells were played as the 30 starting life totals format was an endless battle of Control Vs Combo with few competitive aggressive strategies at all. Within such a metagame, Yisan, The Wanderer Bard was quite problematic as he could create board presence from nothing if left unchecked. This is clearly not true nowadays with Lightning Bolt being the most played coloured card along with Swords to Plowshares, Go for the Throat, Fatal Push being widely played as well. Therefore it's time for our favorite Bard to come back to Duel Commander tables!",
            "Chrome Mox": "Obviously, those two cards differ and the construction constraints they require are not the same. However, their nuisance potential to Duel Commander is close to the same. The balance of those two Moxen relies on the sacrifice of active resources at games starts. However, in Duel Commander, the fact that there is a commander highly raises the amount of available active resources. The constraints mentioned above are therefore reduced. The recent \"partner\" keyword ability stressed that reduction even more. The combination of the unique characteristics of those two Moxen (the cheapest permanent mana accelerators still available on the first turn) along with Duel Commander specifics (singleton and Commander as a repeatable resource) creates a very undesirable variance. Moreover, such a variance currently boosts up two major decks: Baral, Chief of Compliance and Jace, Vryn's Prodigy, that can then be cast on turn one, or where they can be recycled later in the games. For creating an lack of balance in the games and for determining the outcome of games too many times in Duel Commander, those two cards, Chrome Mox and Mox Diamond are now banned.",
            "Mox Diamond": "Obviously, those two cards differ and the construction constraints they require are not the same. However, their nuisance potential to Duel Commander is close to the same. The balance of those two Moxen relies on the sacrifice of active resources at games starts. However, in Duel Commander, the fact that there is a commander highly raises the amount of available active resources. The constraints mentioned above are therefore reduced. The recent \"partner\" keyword ability stressed that reduction even more. The combination of the unique characteristics of those two Moxen (the cheapest permanent mana accelerators still available on the first turn) along with Duel Commander specifics (singleton and Commander as a repeatable resource) creates a very undesirable variance. Moreover, such a variance currently boosts up two major decks: Baral, Chief of Compliance and Jace, Vryn's Prodigy, that can then be cast on turn one, or where they can be recycled later in the games. For creating an lack of balance in the games and for determining the outcome of games too many times in Duel Commander, those two cards, Chrome Mox and Mox Diamond are now banned."
        }
    }
]
