[
    {
        "date": "2019-11-25",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2019/november-2019-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Emry, Lurker of the Loch", "Edric, Spymaster of Trest"],
        "newly_unbanned_as_commander": ["Erayo, Soratami Ascendant", "Zur the Enchanter"],
        "newly_banned_in_deck": ["Scapeshift"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Edric, Spymaster of Trest": "<p>Unfortunately, we had to revise our hopes about Edric, Spymaster of Trest as a legal commander as of today.</p><p>We expected it to be strong, but the magnitude of its power was the reason why it was not legal for the longest time and also, what brought it back on the list in the end.</p><p>In less than a quarter, Edric, Spymaster of Trest proved this decision to be the right one and made for an overpowering comeback to the field.</p><p>Decklists were very soon optimized and started consistently showing impressive results in events around the world. This deck broke many local leagues -too many, actually- to safely keep it legal as a commander, which is why Edric, Spymaster of Trest is once again banned as a commander only, after being experimentally unbanned for a few months of field testing.</p><p>The deck quickly evolved to being too oppressive, and the fact that it got many new additions since the last time it was legal, proved that it earned its place on the ban list.</p>",
            "Emry, Lurker of the Loch": "<p>Needless to say, Emry, Lurker of the Loch strongly echoes the recently banned Urza, Lord High Artificer, the once banned Arcum Dagsson, and even older cards that display a recurring theme in the history of Magic: The old tale of broken blue and artifact cards.</p><p>\"Affinity for artifacts\" is infamous for being one of the most busted mechanics in magic and is single-handedly responsible for multiple other cards being banned in Standard and Modern, where Emry, Lurker of the Lochis already mentioned as one of the best recent additions to the format.</p><p>Her static ability works against the Commander Tax rule, as much as Tasigur, the Golden Fang does, which already proved problematic and reasoned a ban.</p><p>All in all, an almost infinite replayability at almost no cost, along with graveyard synergies and card advantage are way too many arguments to keep Emry, Lurker of the Loch legal any longer.</p>",
            "Erayo, Soratami Ascendant": "<p>After being unbanned as an experiment for three months one of the older cards that once was added to the B&R list, Erayo, Soratami Ascendant is now made clearly, unconditionally legal.</p><p>Erayo, Soratami Ascendant decks proved that they can still do amazing starts, and turn two flipping ability triggers, as rare as they are can still de devastating but many players also reported that they were able to win through Erayo’s Essence static ability, which was one of the few fears players once had about decklists revolving around this commander.</p><p>Judging by the results and global feedback we received, it seems that there is no more reason to think Erayo, Soratami Ascendant will be an oppressive part of the metagame, it proved to be beatable, interactive and still interesting for some players to build. So… Here we are, Erayo, Soratami Ascendant, welcome back!</p>",
            "Scapeshift": "<p>Scapeshift always was a staple in Modern, and recently in Standard as well, even in some other formats where it would be less expected. Despite its long affinity with Valakut, the Molten Pinnacle, it never really was a serious problem in Duel Commander. Until recently, where many players began drawing some advantage from the singleton construction rule that Duel Commander follows. The recent print of many new mountain-typed lands, the addition of Field of the Dead to the serious dangers linked to Scapeshift made it a one-card kill (or close to it), as well as many new cards that have triggered abilities whenever lands enter battlefields.</p><p>In general, fetching/tutoring effects also strongly go against the 100-cards and the singleton rules, which is why many of them are considered too powerful and are currently banned, only keeping the more acceptable ones.</p><p>All those reasons quickly made Scapeshift a danger towards our favourite format health, and made it banned.</p>",
            "Zur the Enchanter": "<p>Three Commanders were experimentally unbanned three months ago. We wrote about Edric, Spymaster of Trest and Erayo, Soratami Ascendant but what about Zur the Enchanter?</p><p>Zur the Enchanter proved to be a major force in the format, reaching many Top Xs. But the dominance of Emry, Lurker of the Loch and Edric, Spymaster of Trest prevented the safe and meaningful gathering of reliable data, so as to confirm or not its oppression. Because of that, we cannot take a definitive good decision about it.</p><p>Zur the Enchanter therefore remains experimentally unbanned until our next regular announcement (“experimentally unbanned” meaning that the card is legal but has a strong probability to be banned again). Invest as your own risk!</p>"
        }
    }
]
