[
    {
        "date": "2020-02-24",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2020/february-2020-rules-bannedrestricted-update",
        "newly_banned_as_commander": [],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Thassa's Oracle", "Ancient Tomb", "Mox Opal"],
        "newly_unbanned_in_deck": ["Sulfuric Vortex"],
        "explanations": {
            "Thassa's Oracle": "<p>With Theros Beyond Death, Thassa's Oracle made its entrance into a lot of formats. It is always exciting to see a ability that states “you win the game” on a new card, except this time the excitement did not last long. While similar to already existing cards like Laboratory Maniac or Jace, Wielder of Mysteries, Thassa's Oracle does not need to stay on the board for its magic to happen and decks that can't interact with it -or with its triggered ability- while it's on the stack have very little ways of beating the combo, when set up correctly.</p><p>In addition to this, Thassa's Oracle only has a converted mana cost of 2, which makes it not only easy to cast along with cards that empty the library on the same turn but also, due to its card types, make it very easy to search out of the deck by a wide variety cards. All these reasons let us believe that Thassa's Oracle stay in our format should be a rather short one.</p>",
            "Ancient Tomb": "<p>Ancient Tomb was made legal again one year after the format was changed to start with 20 life points for players under the assumption that the card would be kept in check by the lower life total and the viability of aggressive decks. While it is true that this land is somewhat painful versus aggressive decks, it is also a fact, that those precise decks are using the card themselves.</p><p>Trading life for resources has always been a dangerous mechanic and it is even more dangerous when being done while being the aggressive deck. Ancient Tomb makes no exception to this and allows for explosive starts. By providing permanent extra mana on the turn it is played, it is a huge tempo gain - especially when it's used to cast and recast commanders. Whether being used to cast commanders or expensive spells like Damnation, Fiery Confluence or Thought-Knot Seer, the result often easily mitigates the damage done by Ancient Tomb most of the time. In order to keep games more interesting and fair Ancient Tomb has to go.</p>",
            "Mox Opal": "<p>Similar to Ancient Tomb, , Mox Opal is played in every artifact-centric deck. The main difference between is played in every artifact-centric deck. The main difference between Mox Opal on one side and on one side and Mox Sapphire and its siblings on the other side is the keyword Metalcraft.</p><p>While it's hard for most decks to have three artifacts on the board, it really isn't when your whole deck -or in the case of Silas Renn, Seeker Adept even one of your commanders- has this card type. In decks with Sai, Master Thopterist or or Akiri, Line-Slinger as commanders Mox Opal does not only help casting the commanders ahead on time but also gives an advantage when arriving late to the party.</p><p>Furthermore, Mox Opal provides the same benefits as Ancient Tomb in those decks without being painful at all, and on top of that, can generate mana of any color. Its banning in Modern for the same reasons, made it even more clear, that Mox Opal should also be banned in Duel Commander.</p>",
            "Sulfuric Vortex": "<p>With the printing of Uro, Titan of Nature's Wrath, Klothys, God of Destiny or Heliod, Sun-Crowned we believe that Sulfuric Vortex will have a meaningful and healthy role in the format again.</p><p>It does not add explosiveness to red tempo / aggressive decks and gives them outs to combat repeatable lifegain from the command zone, as well as providing in a steady tempo damage that is not affected by most board wipes or usual spot removal cards.</p><p>Welcome back Sulfuric Vortex!</p>"
        }
    }
]
