[
    {
        "date": "2021-07-26",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2021/july-2021-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Inalla, Archmage Ritualist", "Ragavan, Nimble Pilferer"],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Gifts Ungiven"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Ragavan, Nimble Pilferer": "<p>The presence of a systematic 1-mana creature that can be accessed from the Command Zone for the first turn authorizes aggressive red decks to pack in less 1-mana drop, which subsequently frees substantial room regarding building strategy constraints. Such room therefore allows those decks to notably improve the average quality of their following draws.</p><p>Moreover, that presence tends to wildly increase the importance of being the starting player in a game. This therefore forces opponents to interact during the first turn so that they do not lose too much tempo. Such structural advantage de facto eliminates other potential candidates for mono-red decks, which limits the deck building choices for an archetype that already shows great performance and diversity in builds.</p><p>For all those reasons, Ragavan, Nimble Pilferer is now banned as a commander.</p>",
            "Inalla, Archmage Ritualist": "<p>Inalla, Archmage Ritualist offered a series of decklists that recently performed a lot by winning on turn 4 (or earlier) with an overwhelming steadiness. Those lists rely on a combo sequence that only requires one card to ignite, and proved capable of going through the sequence again, even when disrupted. In order to at least interact with their game plan, they require opponents to include very specific hate cards in sufficient quantity to be able to draw them regularly.</p><p>However, since those lists require relatively few cards to set up such a winning sequence, they are also made of a decent control shell, which allows them to bypass such hate cards if they are not supported by sufficient pressure. These decks completely polarized and shaped the metagame by eliminating any archetypes that can not offer both those characteristics at a time on one hand, while on the other forcing all other decks to notably modify their lists in a way that is beyond usual habits and needs.Besides, the eminence mechanic, which represents the cornerstone of the deck, forbids interacting with the combo sequence in a decent way. Which makes it necessary to tackle the source of this problem rather than banning one of its pieces.</p><p>For all those reasons, Inalla, Archmage Ritualist is now banned as a commander.</p>",
            "Gifts Ungiven": "<p>Gifts Ungiven has two main ways in which it can be used: on one side it's a powerful draw spell allowing complex and hard to anticipate piles and choices, on the other side it can be used as a multiple tool to fetch specific cards in a library when it's used to assemble combos. It is possible in many cases for the player to leave no real choice and opportunity to the choosing opponent. Such a use provides both existing and future combo decks with an easy to build and mana efficient option to access their different pieces and favours such archetypes in a rather excessive manner.</p><p>Gifts Ungiven provides a perfect example that illustrates the difficulty of reauthorizing cards from the Banned & Restricted list, which in the end very often turn out to be toxic for our game format.</p><p>For those reasons, we chose to ban Gifts Ungiven again.</p>"
        }
    }
]
