[
    {
        "date": "2021-01-21",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2021/january-2021-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Esior, Wardwing Familiar", "Jeska, Thrice Reborn"],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": [],
        "newly_unbanned_in_deck": ["Fireblast"],
        "explanations": {
            "Esior, Wardwing Familiar": "<p>There are many (many) reasons why cards can generate a bad player experience, especially in Duel Commander. Creating a lack of interaction, being a cheap, on-tempo early card that never really fails to arrive on time, and taking advantage of the command zone presence in our specific format family are some of them. Sometimes raw power isn't everything. Sometimes one ability can lead to a bad player experience. It is true that trying to define a good illustration of a decent player experience will probably end up being a lost cause, most of the time.</p><p>Nevertheless, Esior, Wardwing Familiar, which landed with Commander Legends didn't prove to add anything to the sanity of Duel Commander, and showed up as quite a toxic generic commander to pair with almost any other card that shares the partner ability. The lack of interaction, coupled with both older and newer partner-centric strategies didn't really help our format breathe a little around such creatures.</p><p>Over a tenth of different interactions and pairs showed quite good and viable results, and in the end, when all lead to the same disappointment, it means more than anything that Esior, Wardwing Familiar was the common problem. This card, though it reminds of cards like Kira, The Great Glass Spinner to some of us, isn't what we would call a suitable and desired card to create a sane player experience.</p>",
            "Jeska, Thrice Reborn": "<p>Another example of a bad player experience are situations where an object in the game requires immediate response before things go bad. Cards like Omnath, Locus of Creation, Vial Smasher the Fierce or Emry, Lurker of the Loch are banned for being so impactful on the board that they need to be removed each time they are cast.</p><p>Jeska, Thrice Reborn requires a narrow-window answer for it turns any 3+ power creature into a potential bomb. This is something the prominent red decks (based on creatures, archetype-based affinities between cards like Furnace of Rath or Torbran, Thane of Red Fell, or direct damage, whichever) usually scarcely have access to.</p><p>Jeska, Thrice Reborn provides totally out-of-tempo damage to anything that hits the board, and creates a need for an immediate answer, which is not something red decks usually rely on. This adds a new, non-constructive dimension to those decks, which is the reason why we believe Jeska, Thrice Reborn has to go.</p>",
            "Fireblast": "<p>A couple years ago, red decks suddenly became a really visible thing in the metagame. At that moment, there was a window, boosted by some neat new prints by Wizards of the Coast. Red burn decks usually get stopped by any pressure applied to them like early creatures, especially when they can block incoming threats and trade with them, if not blank them.</p><p>Since then, the metagame changed, and the creature ratio and average mana cost have considerably changed. Because red burn decks have one of the highest functional redundancy toolboxes in terms of deck building, identifying which ones are the key ones can sometimes be quite complex.</p><p>Clearly, Fireblast can quickly finish games out of nowhere but it's also a spectacular and iconic card that increases the glamour and attractiveness of the format without creating a major imbalance. Red decks aren't overperforming at the moment, it seems to be an opportunity to allow Fireblast a new chance to get played.</p>"
        }
    }
]
