[
    {
        "date": "2022-05-30",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2022/may-2022-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Shorikai, Genesis Engine"],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Bazaar of Baghdad", "Ragavan, Nimble Pilferer", "Serra's Sanctum"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Shorikai, Genesis Engine": "<p>Commanders that are not creatures are borderline cards by nature. Dodging removals that are universally played is a big advantage.</p><p>They're supposed to remain acceptable considering that structural advantage. What's more, Shorikai is a very versatile tool: it gives board control, creates pure card advantage, and finally, can close games once they're under control. Having most of the fundamental tools needed to any control deck always available in the command zone is already a powerful advantage. Though, being an artifact and thus being hard to remove allowed the deck to rely near-exclusively on the commander: not having to play a lot of card advantage engines allowed the maindeck to be a lot more powerful without ever lacking resources.</p><p>The advantages such a card provides quickly proved right the reasons mentioned herebefore for Shorikai, Genesis Engine to rise very high among final rankings widely more than an healthy format can contain. Those reasons won't be fixed unless a lot of metagame changes are made to a vast majority of decks, which might not even be enough. We chose to have Shorikai, Genesis Engine now banned as a commander.</p>",
            "Bazaar of Baghdad": "<p>Bazaar of Baghdad is one of those problematic cards that share a lot of head-scratching when it comes to legality. It's not busted per se in Duel Commander, as over 15 years of existence, it rarely shined and failed to obliterate the format, despite its very unique and powerful ability. It crosses a lot of attention boundaries: being ultra-iconic, being almost 30-years old, being on the Wizards Of The Coast Reprint Policy list, being almost impossible to find or have it lent, fixing hands, filling graveyards, being a land that can't be responded to,... It even finally found a home commander with Rielle The Everwise, only to mention one.</p><p>Bazaar of Baghdad also showed to be slightly more played online (when players didn't physically need the card) than on paper and not necessarily for testing concerns. The problem is that it has become playable over a small threshold, though still not totally mandatory in some performing decks. Despite its attractivity, the fact that such a card now belongs to museums more than to playing tables and the growing difficulty to get a hand on a copy in any way makes it externally and internally problematic for Duel Commander, a little more every day. We hence thought that it was the time for it to go.</p>",
            "Ragavan, Nimble Pilferer": "<p>There were heavy debates upon which Magic The Gathering card, out of any context, was the best play for a one-mana, turn one play. Ragavan, Nimble Pilferer currently ended those debates. Even though it's still totally feasible to play against it, the pressure, the need for an answer, the additional resources provided still make it usually turn the tides in favour of whoever slammed it on their first turn. The structural reason why it was initially banned as a commander still applies to the one-shot opportunity of starting with it.</p><p>As it is not even a dead card on the late game (though way less of an oppressing one), Ragavan, Nimble Pilferer always held its position of a very fine aggression start for many decks, starting with mono-red aggressive builds. Though this can be a little subtle to spot (it still remains a permanently-dead 2/1 after all), the advantage it gives when not handled in time creates too much difference in favour of whoever played it first on an average, also solving a construction problematic for such aggressive decks.</p>",
            "Serra's Sanctum": "<p>Serra's Sanctum has a long and complex history. Its most complex consideration factor resides in the bias of effect proximity, in the name of long banned cards that are Gaea's Cradle and Tolarian Academy. The proximity being \"producing mana by just tapping, at no cost, up to X controlled archetype permanent of [type]\".</p><p>The other part of the analysis was hence set into the concerned type and the probability of finding them, as well as keeping them on a battlefield. Which results in a resilience versus playability fight (enchantments sticking more than artifacts which in turn stick more easily on a battlefield than creatures, while creatures are the predominant type in Magic, way ahead of enchantments then artifacts). Serra's Sanctum was the hardest to find a good setup for, and the hardest to exploit so far, which explains why it was still legal. But the growing number of newly printed cards which have a strong affinity for Serra's Sanctum suddenly made it visible. The decks that use it have the same outcome as Gaea's Cradle and Tolarian Academy: the restrictions were lighter and lighter, up to a point it finally allowed some complex situations to be solved on the spot, by solely entering a battlefield, allowing a sudden resource outburst which almost always ends up games. Which is why unfortunately, Serra's Sanctum has to join its siblings on the Duel Commander Banned & Restricted list.</p>"
        }
    }
]
