[
    {
        "date": "2022-01-31",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2022/january-2022-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Kraum, Ludevic's Opus", "Livio, Oathsworn Sentinel"],
        "newly_unbanned_as_commander": ["Marath, Will of the Wild", "Teferi, Temporal Archmage"],
        "newly_banned_in_deck": [],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Livio, Oathsworn Sentinel": "<p>Sharing multiple cards in command zones isn't a problem in itself, as explained many times. What can be, on another side, is that some cards get over the line of what is acceptable or not.</p><p>Though Livio, Oathsworn Sentinel neither offers much strength nor notable abilities, it just appears to have recently shown to be of great interest. Since it can always be played on tempo, it demonstrated to be a sufficient strategic play by essence: being dropped as a simple 2/2 for {2} mana value, Livio offers a good curve advantage, allowing the deckbuilder to not play any bad 2-mana creature, thus enhancing the quality of the 99 others as it helps against bad/slow/diminished starting hands, in addition to being a second commander which offers a new color for many other ones.</p><p>One year ago we thought it could remain a safe commander, but it appears to be too much for the format, which is why, in the end, we decided to ban Livio, Oathsworn Sentinel as a commander.</p>",
            "Kraum, Ludevic's Opus": "<p>Kraum, Ludevic's Opus has long been a close-to-acceptable commander. It actually is a 4/4 haste and flying, which is the kind of combination some aggressive and midrange decks already play (like Glorybringer, Stormbreath Dragon, Goldspan Dragon or Hell's Thunder, for instance).</p><p>The fact it also has an extra drawing ability even helps a little against decks that would try to resolve two spells or bait with one lesser first.</p><p>Once having exhausted an opponent's resources, or sometimes simply being played on time, Kraum, Ludevic's Opus actually becomes a quick win condition and fast way to get out of a game. That, in conjunction with another commander since the start of games, makes it a perfect choice to fill two critical slots: a cheaper one to start on curve and this one to finish games.</p><p>Moreover, similar to Livio, Oathsworn Sentinel, but on the other side of the curve, Kraum, Ludevic's Opus allows the deckbuilder to always have a good late game tool without having to commit a lot of deck building space with their non-commander cards. Kraum, Ludevic's Opus will therefore be banned as a commander from now on.</p>",
            "Teferi, Temporal Archmage": "<p>Teferi, Temporal Archmage first appeared in November 2014, and it took some time to appear as a real threat, up to a point it was banned as a commander only in August 2019.</p><p>Since then, the pace at which games are won considerably increased, and many tools it used to rely on were removed, from the legendarily controversial High Tide in May 2020 to the most accessible extra turn spells (in May 2020 as well).</p><p>Such shifts in the B&R list definitely tamed it for now, so, despite the fact Teferi, Temporal Archmage is a planeswalker in a command zone, we concluded that it could be allowed a comeback.</p>",
            "Marath, Will of the Wild": "<p>Marath, Will of the Wild was originally banned in Duel Commander in July 2016. This was another era of Magic The Gathering and Duel Commander.</p><p<Though some things didn't change, some others did. Marath, Will of the Wild has a special, borderline use of the command zone, but in a way that's far from unmanageable. Most decks six years ago used to be annihilating all other aggressive builds, but the tides have turned, and the current builds show that they can compete with such decks.</p><p>It's probable that bringing it to the field will offer new opportunities for aggressive and/or combo decks, as it used to be in the idea, but with many new cards to include… And many more to face. Therefore, Marath, Will of the Wild is back to the fields as a commander, but will remain under special observation.</p>"
        }
    }
]
