[
    {
        "date": "2023-05-29",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2023/may-2023-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Dihada, Binder of Wills"],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Comet, Stellar Pup", "Hogaak, Arisen Necropolis", "Mox Amber"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Dihada, Binder of Wills": "<p>Dihada, Binder of Wills by itself is a very peculiar card in our format: it works mostly as an enabler, doing quite little by itself. However, its role as an enabler is very powerful, especially since it indeed enables not one, but two different gameplans. At first, it acts as a good way to play a classic Reanimate-like plan, as it allows putting powerful but expensive creatures in the graveyard. But also, the mana it gives allows naturally casting that same creature even without a Reanimate-like effect.</p><p>Historically, reanimation decks have always been weak when not getting access to such reanimation effects in a game. But Dihada, Binder of Wills effectively solves this problem by giving tons of mana to cast game breakers. In short, it tends to be more of a hybrid reanimating and ramp deck than a proper combo deck, making most of the usual solutions against reanimator pointless (i.e. graveyard hate, hand disruption, etc.). Last, but not the least, the deck makes full use of Underworld Breach, giving it one more game plan with minimal drawback.</p><p>For this reason, Dihada, Binder of Wills tends to have very few bad matchups, having an edge against aggressive, midrange, and control decks, while being by far one of the best combo decks available.</p><p>Immune to usual hate cards, with very few predators, and having too many gameplans in a single deck, we chose to ban Dihada, Binder of Wills as a commander.</p>",
            "Comet, Stellar Pup": "<p>Comet, Stellar Pup is a very difficult card to evaluate. While it's sometimes underwhelming, it may also close a game straight after being cast, with a little luck on dice rolls.</p><p>Similarly, you may sometimes take some strategic decisions, and sometimes just let yourself be carried by the dog. In the end, its raw power level is quite hard to determine, and its design makes for one of the poorest possible game experiences in Magic The Gathering: which is why Comet, Stellar Pup is now banned.</p>",
            "Hogaak, Arisen Necropolis": "<p>Right now, Hogaak, Arisen Necropolis is one of the best decks in Duel Commander (if not the best). It's able to dominate any aggressive mirror, being at least even (if not positive) against control decks, its traditional predators. However, the deck was a bit behind against some combo decks, the main one being Dihada, Binder of Wills. By removing Dihada, Binder of Wills, Hogaak, Arisen Necropolis will undoubtedly be the best deck in the format, leaving very few possibilities to explore other archetypes, especially in the aggressive category, killing diversity.</p><p>How did it come to this? Hogaak, Arisen Necropolis has indeed been around for some time, being a powerful deck since its printing. At first, it was crippled by its lack of stability: the best structural cards in the deck, like Satyr Wayfinder, were only available as a single card. Recent printings, however, changed a lot of things: first, a lot of redundancy has been added to the deck, streamlining its gameplay, and making successive Hogaak, Arisen Necropolis casts very easy. If a \"wrath\" effect used to be enough to slow the deck, it tends to be less and less effective, thus making the match-up positive, and progressively removing any bad match-up.</p><p>That being said, some of the problems disappear if we're talking about playing Hogaak, Arisen Necropolis as a card apart from choosing it as a commander. Some, however, remain: the card is a game plan by itself, while being very easy to search for. While Uro, Titan of Nature's Wrath was a recursive tool for control decks, Hogaak, Arisen Necropolis appears to be in a very similar position for some decks. To prevent any future abuse of the card, we chose to ban Hogaak, Arisen Necropolis in any starting game zone.</p>",
            "Mox Amber": "<p>Being the last of the current Mox cards available with potential when playing Duel Commander, Mox Amber has always been a card debated by many. With the rise of strong decks making use of cheap commanders such as the Yoshimaru, Ever Faithful-based variants, Mox Amber has been put in the spotlight, showing that it will always be a problem as long as it has a commander to support it, regardless of the power level of the latter.</p><p>Since games with an early Mox card in play tend to be very one-sided, limiting any strategic decisions and breaking the natural flow of early Magic The Gathering resources, while giving another edge to the already powerful advantage of playing a cheap commander, we chose to ban Mox Amber.</p>"
        }
    }
]
