[
    {
        "date": "2019-08-26",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2019/august-2019-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Arahbo, Roar of the World", "Najeela, the Blade-Blossom", "Teferi, Temporal Archmage", "Urza, Lord High Artificer", "Yuriko, the Tiger's Shadow"],
        "newly_unbanned_as_commander": ["Edric, Spymaster of Trest", "Erayo, Soratami Ascendant", "Zur the Enchanter"],
        "newly_banned_in_deck": ["Timetwister"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Arahbo, Roar of the World": "<p>Alike the aforementioned Yuriko, the Tiger's Shadow, the rare cards that do turn around the command zone effects are always problematic, especially when designed for multiplayer games. Arahbo, Roar of the World does not make an exception to this problem. Though it does not ignore the command tax, like Yuriko, the Tiger's Shadow or Derevi, Empyrial Tactician, though it does not have an independent trigger like Oloro, Ageless Ascetic, it does have a perpetual tribal boost like Edgar Markov does.</p><p>Such tribal dependency used to be tolerable, up to a certain point. Arahbo, Roar of the World was always a constant pressure, junk creature, cheap creatures-dependent deck archetype. But as more and more replacements, if not strict upgrades came to the rescue, the constant need for opponents to have a perpetual answer, though delayed from one turn, became too much now to allow this commander any more.</p>",
            "Edric, Spymaster of Trest": "<p>Those three cards share a few things in common. They were all banned as commanders (in 2010, 2012 and 2014), which made them quite famous for being dangerous a few years ago. But the world has changed since then, and Duel Commander now has a completely new metagame, a new B&R list and a very different set of rules.</p><p>Be warned though: those commanders are made legal as of this announcement, but they are under a very special curse: they are back to the fields as an experimental set of changes. Since there is no large-scale data regarding how they could perform in this new world, they do deserve a chance. Making them legal again offers very interesting possibilities for players, and new building opportunities. We need the community experience, creativity and work in tournament situations to figure out if they deserve to be legal or not.</p><p>Keep an eye on how they perform, though, for we will truly do such a thing, and that could end up with one or several of them, if not all of them being banned again during the next announcements. Should they crush the format, or never be fair decks, they will go back to oblivion.</p>",
            "Erayo, Soratami Ascendant": "<p>Those three cards share a few things in common. They were all banned as commanders (in 2010, 2012 and 2014), which made them quite famous for being dangerous a few years ago. But the world has changed since then, and Duel Commander now has a completely new metagame, a new B&R list and a very different set of rules.</p><p>Be warned though: those commanders are made legal as of this announcement, but they are under a very special curse: they are back to the fields as an experimental set of changes. Since there is no large-scale data regarding how they could perform in this new world, they do deserve a chance. Making them legal again offers very interesting possibilities for players, and new building opportunities. We need the community experience, creativity and work in tournament situations to figure out if they deserve to be legal or not.</p><p>Keep an eye on how they perform, though, for we will truly do such a thing, and that could end up with one or several of them, if not all of them being banned again during the next announcements. Should they crush the format, or never be fair decks, they will go back to oblivion.</p>",
            "Najeela, the Blade-Blossom": "<p>The archetype that Najeela, the Blade-Blossom usually allows to build is quite unique in its genre: most players usually build it as a tribal warrior five-color deck, which contains the ultimate best of them, along with regular format staples. Though Najeela, the Blade-Blossom is less played than the other newly banned commanders in this announcement, it still shows a recurring field presence in all tournaments.</p><p>The toxicity of Najeela, the Blade-Blossom as a commander can be not so easy to deceive at first, but the overly aggressive deck that it is -despite the fact that it requires a very expensive manabase, which can be segregating-, along with the very finest choices of creatures, in any color, and having to face the additional tokens from the attack phases makes it a very oppressive commander, that most decks have too much of a hard time to deal with. Therefore is the card now banned.</p>",
            "Teferi, Temporal Archmage": "<p>There have always been a fistful of decks revolving around spell-avalanche, High Tide close-to-combo strategies. Along Duel Commander history, most mono-blue decks have tried such a strategy, often combining the permanent suppression of a blue-based control deck and a few cards dedicated to a game-ending combo. Albeit relying on affinity key cards like The Chain Veil, Rings of Brighthearth abuses or Stasis locks, decklists showed to be very well performing, almost always transforming tournament metagame presence into top X results.</p><p>Teferi, Temporal Archmage kept gaining very few key cards since then. But the pressure of such a blue deck that can answer most of the current threats combined with a fast, surprising winning combo, and a non-creature commander showed why this commander now had to be banned, despite requiring some skills to successfully resolve. Answering the combo is unfortunately usually useless, even if opponents have answers to it.</p>",
            "Timetwister": "<p>Being the Duel Commander Rules Committee, we value metagame balance but we also do value spectacular and cheesy plays. We need solid basis but we also want the format to give outstanding games. Some cards, sometimes obviously overly strong like Skullclamp or Demonic Tutor are legal for that reason. Timetwister was legal since the origins of the format for this reason as well. But it does not succeed anymore, as it turned out to a speculation tool. It became insanely hard to get one copy now, for there are fewer and fewer of them available and its colossal financial value makes it almost impossible to be borrowed.</p><p>Having no more of a fun value anymore makes Timetwister be only considered for its power level. As a Power Nine card, it does not deserve to be legal in Duel Commander anymore.</p>",
            "Urza, Lord High Artificer": "<p>Among the commanders that have been printed so far, it seems like Urza, Lord High Artificer is one of the most powerful ever. It cumulates many major advantages: it generates fast colored mana, has a four-point strength body, generates card advantage, works with artifacts, it’s easy to defend (as it is blue), and it is totally recastable. Many of these similarities have already left the vast pool of legal cards a long time ago. This strongly echoes to Tolarian Academy, for instance, like all the fast mana accelerators, and all of the strongest commanders ever printed.</p><p>Rarely in the history of Duel Commander did we face such raw power in one emblematic card. There’s no doubt why Urza, Lord High Artificer gets played in Modern and Legacy as well. For all those reasons, after crushing the largest Duel Commander event ever, Urza, Lord High Artificer is no longer legal in Duel Commander.</p>",
            "Yuriko, the Tiger's Shadow": "<p>It’s been exactly a year and a handful of days that Yuriko, the Tiger's Shadow was first printed, in a commander-centric edition. Yuriko, the Tiger's Shadow is yet another card that ignores or abuses core Commander effects, such as the commander tax. Though some of those cards are still acceptable, for they aren’t overpowered, Yuriko, the Tiger's Shadow was already extremely powerful the day it was out.</p><p>Nevertheless, it didn’t stop here. The usual winning decklists gained more and more unblockable cheap attackers, structural additions, either being a ninja or being a turn one/two attacker with any evasive ability. In the end, the deck gained too many good cards, especially with the addition of the awesome Modern Horizons edition. The fact that it still gained power that fast after only a year made the deck too toxic for a diverse metagame, adding way too much pressure and insane damage over too many opponent decks, often very early.</p>",
            "Zur the Enchanter": "<p>Those three cards share a few things in common. They were all banned as commanders (in 2010, 2012 and 2014), which made them quite famous for being dangerous a few years ago. But the world has changed since then, and Duel Commander now has a completely new metagame, a new B&R list and a very different set of rules.</p><p>Be warned though: those commanders are made legal as of this announcement, but they are under a very special curse: they are back to the fields as an experimental set of changes. Since there is no large-scale data regarding how they could perform in this new world, they do deserve a chance. Making them legal again offers very interesting possibilities for players, and new building opportunities. We need the community experience, creativity and work in tournament situations to figure out if they deserve to be legal or not.</p><p>Keep an eye on how they perform, though, for we will truly do such a thing, and that could end up with one or several of them, if not all of them being banned again during the next announcements. Should they crush the format, or never be fair decks, they will go back to oblivion.</p>"
        }
    }
]
