[
    {
        "date": "2020-11-20",
        "special": "New fixed schedule for announcements: the last monday of every odd month",
        "link": "https://www.mtgdc.info/announcements/2020/november-2020-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Akiri, Line-Slinger", "Omnath, Locus of Creation", "Thrasios, Triton Hero", "Tymna, the Weaver"],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Jeweled Lotus", "Uro, Titan of Nature's Wrath"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Jeweled Lotus": "We do not preemptively ban cards without any data, with some very rare exceptions. This is exactly what is Jeweled Lotus would look like: an exception. This card is far too close to the original, almighty Black Lotus. This card is designed for multiplayer where casting this kind of card is a casus belli with all other players. In duel, this drawback does not exist and it unfairly increases the variance of games by allowing the casting of one (or two) commanders far too early in a game. You may expect future cards with a similar magnitude of power level to be banned from Duel Commander as soon as possible.",
            "Uro, Titan of Nature's Wrath": "<p>The existence of aggressive strategies seems essential to us in a sane metagame. Now, the recursion and inevitability of life gain while developing a powerful game plan appears too oppressing against those aggressive strategies. It condemns them to extinction. For those reasons we chose to ban Uro, Titan of Nature's Wrath and Omnath, Locus of Creation.</p><p>As a commander, it seems to us that Uro, Titan of Nature's Wrath allows developing a blue-dominant control-based strategy while overcoming its greatest vulnerability: weakness against aggressive decks. Indeed, the recurrence of the commander when coupled with life gain and an integrated card advantage tool appears to leave us with a commander that’s way too complete. Furthermore, the card itself allows beating aggressive strategies and crushing statu quo situations a flawless way.</p><p>Also, the use of Uro, Titan of Nature's Wrath with library-searching tools to send it straight to graveyards has been noticed. This means that not only is it a powerful commander, but also a (sometimes even) more powerful card due to its recursion, becoming a second commander, both available in an alternate command zone on one side AND a way too complete and easy-to-cast card on another side. When combined, those two specificities produce something really toxic. As you saw with the stats of this card: it is not only about Duel Commander, and Uro, Titan of Nature's Wrath is very trendy in Duel Commander but also demonstrates a stabilized presence in sanctioned formats.</p><p>Lastly, we are deeply convinced that Uro, Titan of Nature's Wrath makes games way less interesting and tighter, which is against our vision of a sane format and player experience. Looking at some recent statistics, it finally seems that many players understood all those reasons, and the field presence of Uro, Titan of Nature's Wrath decks reached a threshold that is enough to draw some attention. For all those reasons, we chose to ban Uro, Titan of Nature's Wrath.</p>",
            "Omnath, Locus of Creation": "<p>The existence of aggressive strategies seems essential to us in a sane metagame. Now, the recursion and inevitability of life gain while developing a powerful game plan appears too oppressing against those aggressive strategies. It condemns them to extinction. For those reasons we chose to ban Uro, Titan of Nature's Wrath and Omnath, Locus of Creation.</p><p>We are noticing that the presence of Omnath, Locus of Creation in top finishes increases steadily, just behind Uro, Titan of Nature's Wrath. Duel Commander provides a wide range of tools to enable the multiple land plays such decks are looking for. This allows power plays combining tempo advantage, card advantage and constant life gain. It allows decks based on this commander to effectively fight against aggressive decks as well as control decks, using lands which are especially hard to deal with. Omnath, Locus of Creation can handle both sides of the metagame way too easily by itself. Also, it seems that much alike Uro, Titan of Nature's Wrath, Omnath, Locus of Creation decks are on the rise, reaching over a threshold of 5% Top X finishers, with a very good transformation rate on the competition scene, somehow taking part in the confirmation that the deck was becoming an obviousness for many players already.</p>",
            "Thrasios, Triton Hero": "<p>The <em>partner</em> keyword is an old known worry for many. Nevertheless, it is a very interesting mechanic (Wizards of The Coast commercial studies validated this by making them regularly print them new ones, till this month, reaching a total of 78 of the legendary ones). But it can also be oppressive. In the past, 2 of them were already banned in 2017 (n.b. Vial Smasher, The Fierce / Bruse Tarl, Boorish Herder are currently banned in Duel Commander).</p><p>But even if we thought Akiri, Line-Slinger, Thrasios, Triton Hero and Tymna, the Weaver to be really borderline since 2016 we couldn’t ban them earlier without making some color combinations inaccessible for players, based on partner-keyword commander combinations.</p><p>News partner legendary creatures and planeswalkers from Commander Legends partially solve this problem and now is the time to make a change regarding this situation. Some Commander Legends newly printed partners are also debatable as well. But we’ll first need some data to check if the metagame solves them or if they end up being too oppressive, regardless.</p><p>Among all the partners that drew attention, if it were only for historical reasons, playability, color choice, and actual stats, Thrasios, Triton Hero would be on top of the list, and always was. When looking at all partner creatures, this one is problematic for many reasons. First, it is an easily recastable creature that comes early into play, and has decent block statistics for its cost (like blocking, let’s say, a Thalia, Guardian of Thraben, or a Zurgo Bellstriker, for example). Second, it adds a pair of interesting colors to the game (just take a look at the colors of the other non-partner cards banned in this announcement, for instance...). Third, the history of decks that include Thrasios, Triton Hero is a history of creature-based combos. Which, as you might guess… Benefit from having two more in the command zone, but also benefit from using a commander that is actually a part of a win condition, among others.</p><p>For those statistical differences, Thrasios, Triton Hero is the first of those three to be banned in this announcement.</p>",
            "Akiri, Line-Slinger": "<p>The <em>partner</em> keyword is an old known worry for many. Nevertheless, it is a very interesting mechanic (Wizards of The Coast commercial studies validated this by making them regularly print them new ones, till this month, reaching a total of 78 of the legendary ones). But it can also be oppressive. In the past, 2 of them were already banned in 2017 (n.b. Vial Smasher, The Fierce / Bruse Tarl, Boorish Herder are currently banned in Duel Commander).</p><p>But even if we thought Akiri, Line-Slinger, Thrasios, Triton Hero and Tymna, the Weaver to be really borderline since 2016 we couldn’t ban them earlier without making some color combinations inaccessible for players, based on partner-keyword commander combinations.</p><p>News partner legendary creatures and planeswalkers from Commander Legends partially solve this problem and now is the time to make a change regarding this situation. Some Commander Legends newly printed partners are also debatable as well. But we’ll first need some data to check if the metagame solves them or if they end up being too oppressive, regardless.</p><p>Akiri, Line-Slinger is a different problem. It shares the same analysis that Thrasios, Triton Hero has: strength, mana cost, and colors, regarding the abilities it has. The difference here is that Akiri, Line-Slinger is specific to a very precise archetype, or variety of archetypes. And it does that very well. Too well, actually. Resulting decks are very oppressive, and even though new combinations including creatures like Ardenn, Intrepid Archaeologist might be strong competitors, Akiri, Line-Slinger, whatever the colors it is paired with (most of the time with Silas Renn, Seeker Adept, to create a deck that fuels on colors which play around artifacts the most, much alike the already-banned Breya, Etherium Shaper would do), remains a very strong threat and clearly doesn’t help with keeping a fair format.</p>",
            "Tymna, the Weaver": "<p>The <em>partner</em> keyword is an old known worry for many. Nevertheless, it is a very interesting mechanic (Wizards of The Coast commercial studies validated this by making them regularly print them new ones, till this month, reaching a total of 78 of the legendary ones). But it can also be oppressive. In the past, 2 of them were already banned in 2017 (n.b. Vial Smasher, The Fierce / Bruse Tarl, Boorish Herder are currently banned in Duel Commander).</p><p>But even if we thought Akiri, Line-Slinger, Thrasios, Triton Hero and Tymna, the Weaver to be really borderline since 2016 we couldn’t ban them earlier without making some color combinations inaccessible for players, based on partner-keyword commander combinations.</p><p>News partner legendary creatures and planeswalkers from Commander Legends partially solve this problem and now is the time to make a change regarding this situation. Some Commander Legends newly printed partners are also debatable as well. But we’ll first need some data to check if the metagame solves them or if they end up being too oppressive, regardless.</p><p>It is quite true that the partner keyword helps a little with card advantage with extra availability. Tymna, the Weaver adds more to that, providing a bleeding extra advantage to any situation where opponents couldn’t handle creatures on the battlefield (which actually happens more often that it seems). The black part of its abilities that basically trades life points for card drawing is quite over the top of many other partners. Despite the fact it doesn’t really look like an actual threat, too much is too much. Which is why, in addition to the other ones, Tymna, the Weaver is now banned as a commander in Duel Commander.</p>"
        }
    }
]
