[
    {
        "date": "2021-09-27",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2021/september-2021-rules-bannedrestricted-update",
        "newly_banned_as_commander": ["Asmoranomardicadaistinaculdacar", "Winota, Joiner of Forces"],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Maddening Hex"],
        "newly_unbanned_in_deck": [],
        "explanations": {
            "Maddening Hex": "<p>Maddening Hex has strong echoes to cards like Vial Smasher the Fierce or Eidolon of the Great Revel, and though many currently legal cards like this are allowed in Duel Commander, this one accumulates a few concepts that make it not really fair. First, it only costs 3 mana. Second, it deals between 1 and 6 damage per hit (3.5 on the average), most solutions actually triggering another hit (plus: it's only damaging the hexed player). Third, it only requires red, one of the most aggressive colors. Fourth, it's an enchantment, being the hardest permanent type to remove, that some colors don't really have answers to. Fifth, the damage is random, and though it is a totally fair and fun mechanic, some people don't like the fate of their losses being decided by a dice roll. And last, it was designed, again, as a card that could be fair and funny in multiplayer as it would be randomly reattached, which doesn't change a thing in duel. Sometimes this has no consequences, sometimes it does.</p><p>For all those reasons, and though roughly similar cards like Pyrostatic Pillar or Spellshock will remain legal, Maddening Hex is now banned in Duel Commander.</p>",
            "Asmoranomardicadaistinaculdacar": "<p>Asmoranomardicadaistinaculdacar decks are a very particular aggressive-combo type. In a sense that they combine an aggressive plan on one side, through curving a 3/3 for {1} -generally on turn 1-2- and on the other side a critical mass of synergies based on discarding and graveyard use. All that does allow decks built around that commander to have an important recursion at disposal any time.</p><p>Although it is undeniable that these decks suffer from a couple of bad match-ups, it still has a crushing advantage against other aggressive decks, mostly from recurring accessibility to removal effects. This board management becomes accessible through a complimentary artifact, a permanent type that most aggressive decks can't handle that fast or that often, unless when done at the cost of deck building concessions.</p><p>This double specificity poses a fundamental problem, in a problem that it tends to asphyxiate diversity in aggressive archetypes; which was, until now, rather balanced. For those reasons, we chose to ban Asmoranomardicadaistinaculdacar as a commander.</p><p><i>** Just kidding: this decision was solely taken upon the length of the card name, since we can't remember nor pronounce it correctly, we chose to forbid that card, after checking that it doesn't break our website design due to the name length. **</i></p>",
            "Winota, Joiner of Forces": "<p>Even though doubly tribal deck building can be hell of a nightmare, having one of the tribal conditions being the most printed creature type ever and the other one being “anything that belongs to the rest”, the tribal conditions are not really such a building constraint. Being a solid, perfectly square 4/4 for {4} body is also a checked condition. Acting on the turn it enters the battlefield (just in a form of “improved haste”) also requires vigilance from everyone, not so as to mention that the objects found in libraries become indestructible (a once super rare keyword that now became very common over the last 10 years, much like “hexproof” or “shroud”, other anti-interactive keywords are). Lastly, it doesn't even need to be part of the combat step itself.</p><p>Those characteristics thus present a similar problem to that of Asmoranomardicadaistinaculdacar : Winota, Joiner of Forces is an aggressive-combo deck that benefits from an overwhelmingly positive match-up against other aggressive decks, while being at least good against other archetypes. Again, diversity is diminished by this fact, and, following that logic, the simultaneous ban of Asmoranomardicadaistinaculdacar bears the risk of Winota, Joiner of Forces becoming the next problematic deck.</p><p>Such oppressive commanders (or cards) that require immediate response, and the fact that the decks that play those cards also have a couple last-chance responses to opponents' responses aren't really what creates great game experiences. Again, here, being beaten by randomly revealed cards off the top of libraries doesn't create very warm feelings from people losing to those kinds of decks, especially when the price paid to do so isn't that much of a constraint. For those reasons, and after a continuous, growing performance of Winota, Joiner of Forces decks, we chose to ban that card as a commander from now on.</p>"
        }
    }
]
