[
    {
        "date": "2023-07-31",
        "special": "",
        "link": "https://www.mtgdc.info/announcements/2023/july-2023-rules-bannedrestricted-update",
        "newly_banned_as_commander": [],
        "newly_unbanned_as_commander": [],
        "newly_banned_in_deck": ["Deadly Rollick", "Flawless Maneuver", "The One Ring"],
        "newly_unbanned_in_deck": ["Eidolon of the Great Revel", "High Tide"],
        "explanations": {
            "Deadly Rollick": "Like Flawless Maneuver, Deadly Rollick is best served by low-mana-cost commanders which aim to dominate the battlefield. The role it plays is unparalleled when confronted with a game whose strategy is similar, allowing expansion and uncompromising interaction to be combined at the maximum speed of development, which greatly unbalances the game. Also recognized as being used by otherwise high-performing games, Deadly Rollick is banned.",
            "Flawless Maneuver": "Flawless Maneuver is a card that fulfills two roles. It allows protecting owned creatures from destruction spells or making them immune to combat damage. This is a card intended to be used by strategies that favor the domination of the battlefield. Its potential is maximized by low mana cost commanders. Those commanders which structurally benefit from Duel Commander rules. It provides a shelter that allows neglecting any risk-taking related to the maximum expansion on the battlefield and plays with the strategic implications of engaging in creature combat. The readability of this card is particularly complicated as it is not represented by mana availability. Its use by recognized dominant games is also a reason why Flawless Maneuver is now banned.",
            "The One Ring": "<p>The One Ring is a problematic card for Duel Commander. The mass of resources that this card brings is considerable and all strategies can benefit from it, without restriction of color identity.</p><p>In decks that are designed to maximize threat within a minimum time, it's a permanent that serves the purpose of generating a second wind perfectly, and sits at a point on the mana curve that fits exactly such a need. The drawback of the card is compensated here by the gap in life points that these games aim to produce prior to the use of The One Ring.</p><p>Games designed to achieve later game mastery can use The One Ring to advantage against all strategies. If the situation is problematic due to an unfavorable balance in terms of creature possession, the effect triggered when this permanent enters the battlefield is likely to absorb the loss of life points caused by several of its activations. If the situation is one of a confrontation based essentially on the accumulation of resources, The One Ring gives its controller the key to victory.</p><p>In games designed to win the game by the effect of the explosive combination of certain cards, The One Ring is once again ideal, due to its ability to protect the capital of life points while stimulating the search for cards essential to the achievement of the game plan.</p>",
            "Eidolon of the Great Revel": "Faced with an increasingly powerful evolution of cards, spot removals have seen their costs reduced and many more of them are now able to interact early in the game. Eidolon of the Great Revel is a powerful aggressive card that has the ability to hinder players from performing a chain of several cards to achieve a powerful effect, but it retains weaknesses against other aggressive games. Given its contribution to the format, Eidolon of the Great Revel is now legal.",
            "High Tide": "High Tide is an archetype by itself. When it was banned, this archetype had the upper hand against control decks. However, the proactive strategies that were available at the time were either not disruptive enough, or not fast enough to keep High Tide in check. Now that such decks exist, High Tide could provide a different way to play combo, and thus provide more diversity to the metagame, while, at the same time, keeping the powerful control shell in check."
        }
    }
]
